
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * azurerm_key_vault_secret.redis_access_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_access_key must be replaced
-/+ resource "azurerm_key_vault_secret" "redis_access_key" {
      ~ id                      = "https://et-prod.vault.azure.net/secrets/et-syr-redis-access-key/fb55b0226ad646d69231a117f81cc8f4" -> (known after apply)
      ~ name                    = "et-syr-redis-access-key" -> "et-syr-redis-key" # forces replacement
      ~ resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.KeyVault/vaults/et-prod/secrets/et-syr-redis-access-key/versions/fb55b0226ad646d69231a117f81cc8f4" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.KeyVault/vaults/et-prod/secrets/et-syr-redis-access-key" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "fb55b0226ad646d69231a117f81cc8f4" -> (known after apply)
      ~ versionless_id          = "https://et-prod.vault.azure.net/secrets/et-syr-redis-access-key" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":139,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->